matthewdeanmartin/mastomini/mastomini_rs/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# N16R8: 8 MiB octal PSRAM holds the domain state (spec/03 memory budget).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_NVS_ALLOCATE_CACHE_IN_SPIRAM=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=65536
CONFIG_FREERTOS_UNICORE=n
CONFIG_ESP_WIFI_TASK_PINNED_TO_CORE_0=y
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU0=y
# Mastodon clients send long OAuth URLs and headers (spec/01 sdkconfig table).
CONFIG_HTTPD_MAX_URI_LEN=1024
CONFIG_HTTPD_MAX_REQ_HDR_LEN=4096
# Two listeners' sockets (src/bin/esp32.rs): (7 + 2) + (4 + 2) + DNS.
CONFIG_LWIP_MAX_SOCKETS=20
CONFIG_LWIP_MAX_ACTIVE_TCP=20
# 8 segments in flight instead of 4: a 40-post timeline is tens of KiB.
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=11520
CONFIG_HTTPD_ERR_RESP_NO_DELAY=y
# HTTPS on 443 next to HTTP on 80 (docs/security/https.md), on esp-tls
# directly (src/bin/esp32/server.rs).
CONFIG_ESP_HTTPS_SERVER_ENABLE=y
CONFIG_ESP_TLS_SERVER=y
# A client that reconnects resumes its TLS session: no key exchange or
# signature, which is most of the ~1 s handshake.
CONFIG_ESP_TLS_SERVER_SESSION_TICKETS=y
# Precomputed tables (flash, not RAM) for the fixed-base multiplication
# in every ECDHE key exchange.
CONFIG_MBEDTLS_ECP_FIXED_POINT_OPTIM=y
# Full-size outgoing TLS records: fewer records and MACs per response.
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=16384
# TLS sessions allocate from PSRAM, leaving internal RAM for Wi-Fi and task
# stacks. That keeps full 16 KiB TLS records: browsers send avatar uploads
# in them. (nanacoin shrank its input buffer to 4 KiB instead, which only
# works because its request bodies are 1 KiB.)
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
# A TLS handshake (RSA-2048 signature, software ECDHE P-256) took about 1.5 s
# at the default 160 MHz. The board is mains powered: run at full speed.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=n
# Boot logs also on the USB port, so deploys can read boot evidence.
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
